{
  "switch_language": "Mettre en {language}",
  "close": "Close",
  "send_mail": "Send a mail",
  "menu": {
    "home": "Home",
    "experiences": "Work Experiences",
    "projects": "Projects",
    "education": "Education"
  },
  "home": {
    "presentation_title": "Web Developer Engineer",
    "presentation_title_company_name_at": "At",
    "presentation_title_company_name": "Enalean",
    "presentation_name": "Hi 👋! My name is Benjamin Bouillot, a french web developer at Grenoble, France.",
    "presentation_other": "Here there are my different professional experiences, and some personal projects.",
    "presentation_final": "Development is my passion since years, that why I have a Master's Degree in Development and Management (MIAGE) at UGA in 2020.",
    "presentation_cv": "You can download my resume (french version only):",
    "presentation_cv_download": "here!"
  },
  "experiences": {
    "title": "Professional Experiences",
    "enalean_1021_present": {
      "entreprise": "Enalean",
      "localisation": "Crolles, France",
      "title": "Web Developer Engineer",
      "date_end": "Now",
      "content_1": "I'm a front and back developer. I <strong>integrate models</strong> on front of Tuleap (with Vue.Js + TypeScript), I maintain and upgrade the <strong>REST API</strong> (PHP). I create some <strong>tests</strong> too, like unit tests, integration tests, end-to-end tests and validation tests.",
      "content_2": "During this period, I work on an <strong>integration of GitLab</strong> in Tuleap. This integrations allorw to <strong>reference a Tuleap's artifact/issue in GitLab</strong> commit or GitLab Merge Request.",
      "content_2_link_begin": "You can see this integration on this video {0}.",
      "content_2_link_end": "here",
      "content_3": "<strong>Languages</strong>: PHP, Vue.Js, TypeScript/JavaScript, PHPUnit, Jest, Mock, Cypress",
      "content_4": "<strong>Tools</strong>: NPM, Docker, Gerrit, Jenkins, Nix, Webpack"
    },
    "enalean_intership_master": {
      "entreprise": "Enalean",
      "localisation": "Crolles, France",
      "title": "Work-Study program (1 year) - Create widget to improve Tuleap dashboard",
      "summary": "This widget, <i>named Project Milestones</i>, resume all Milestones in development with design highlighting KPIs of agile method: Scrum (like Remaining Effort, Remaining Time, Initial Effort, Sprints, ...) and improve decision making of Product Owners or managers. I created 2 graphs (BurnDown and BurnUp) with D3.js.",
      "technique": "It has been developed with Vue.Js and PHP. During this year, I had another mission that was to integrate and use TypeScript in Tuleap instead of JavaScript. And I improved some API REST routes",
      "source_code_link_begin": "{0} you will find widget's source code.",
      "source_code_link_end": "Here",
      "languages": "<strong>Languages used</strong>: PHP, Vue.Js, TypeScript, D3.js, PHPUnit, Jest, Cypress",
      "tools": "<strong>Tools used</strong> : NPM, Docker, Gerrit, Jenkins, Webpack, Méthodologie Scrum (Code review, Pair Programming, ...)"
    },
    "enalean_intership_licence": {
      "entreprise": "Enalean",
      "localisation": "Crolles, France",
      "title": "Internship (3 months) - Development of an automation allowing the synchronization of 2 instances of Tuleap",
      "summary": "This internship's goal was to demonstrate the possibility of synchronize 2 Tuleap's instances automatically. For example, replication of issues/artifacts from one instance to another automatically.",
      "technique": "This automaton was has been developed with PHP. When an issue/artifact is created or updated in one Tuleap's instance, then a webhook is called in another Tuleap's instance with a payload containing all necessary informations, afterward a XML file is automatically generated with these informations and it is imported in the Tuleap's instance to replicate the issue/artifact.",
      "languages": "<strong>Languages used</strong>: PHP, PHPUnit",
      "tools": "<strong>Tools used</strong> : NPM, Docker, Gerrit, Jenkins, Webpack, Méthodologie Scrum (Code review, Pair Programming, ...)"
    },
    "other_experiences": {
      "localisation": "Chambéry, France",
      "title": "Others works experiences (1 year)",
      "summary": "When I got my High school Degree, I worked during 1 year before continue my studies. For example I worked like cleaner, grapes picker, dock agent..."
    }
  }
}